Revit 2027 API
PerformanceAdviserRules Class
Provides a container of all Revit built-in PerformanceAdviserRuleId instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PerformanceAdviserRules
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PerformanceAdviserRules
Public NotInheritable Class PerformanceAdviserRules
public ref class PerformanceAdviserRules abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PerformanceAdviserRules = class end
See Also
Reference
Autodesk.Revit.DB Namespace